{"data":{"site":{"siteMetadata":{"title":"Jenssen Lee","author":"Jenssen Lee"}},"markdownRemark":{"id":"d50434a5-be34-532d-8e25-501964420ac1","excerpt":"Todo List  was a front-end project I created during Week 4 of JumpStart. The whole week was dedicated for us to build something using what we learnt so far…","html":"<p><a href=\"https://jumpstart-todo-list.netlify.com/\">Todo List</a> was a front-end project I created during Week 4 of JumpStart. The whole week was dedicated for us to build something using what we learnt so far - the only criteria is it must be in React. We presented it on the following Monday morning.</p>\n<h3>Use Case:</h3>\n<p>My notes from the classes were becoming overwhelming. I was using Google Sheets to take notes because I needed a quick and dirty way to store as much information as possible. It allowed me to use the cells as question and answer, kinda like flashcards. <em>But it didn’t allow me a quick overview of each topic.</em></p>\n<p>My primary motivation for building a Todo List was to solve this. To fulfill my requirements it must have:</p>\n<h4>Features (must be able to):</h4>\n<ol>\n<li>Create nested list where each child item is also able to have its own children</li>\n<li>Add, edit and remove each list item</li>\n</ol>\n<!-- **Good to have:**\n1. Drag and drop to allow user to reorder it -->\n<h4>Repos involved:</h4>\n<ul>\n<li>react-dnd-chessboard</li>\n<li>react-app-todo-list</li>\n</ul>\n<h4>Problems faced:</h4>\n<ol>\n<li>How should I design my items state? What should I use? An array of objects or object of objects to represent my nested items?</li>\n<li>What about the id of each item object? It has to be unique because I will be using it as React keys too.</li>\n<li>Using spread and rest operator to pass props down from parents to children</li>\n</ol>\n<p><strong>1 -</strong> I settled with an array of objects because at first I wanted to build a nested todo list whose items are capable of being reordered by drag and drop. However, due to lack of time I had to put it on hold in the interest of getting the bare minimum out first.</p>\n<p>One way to reorder items is to change its index, or I could loop through and sort the object based on its keys. Changing the index seemed less expensive so I chose that.</p>\n<p><strong>2 -</strong> I thought of using <code class=\"language-text\">id: 1</code> for the parent item, <code class=\"language-text\">id: 1-1</code> for its child and <code class=\"language-text\">id: 1-1-2</code> for its grandchild. The idea is to keep concatenating <code class=\"language-text\">-number</code> to represent its children. But what if I implemented drag and drop? In that case, what’s the point of using <code class=\"language-text\">-number</code> to denote its child relationship, when the user is allowed to drag a child item to its parent level? Thereby negating any benefits from using <code class=\"language-text\">-number</code> to represent the child relationship.</p>\n<p><strong>3 -</strong> I tried to use spread and rest operators to pass down props, but somehow there was an error.</p>\n<p><strong>4 -</strong> I didn’t understand what was written for react-dnd-chessboard</p>\n<h4>Lessons learnt:</h4>\n<ol>\n<li>Deep cloning is only for… I don’t need to do deep cloning. React keep tracks of object’s outer references, it doesn’t care about its inner references. Shallow cloning works for my case because it creates an array of objects with different outer reference and the same inner references. Any mutation happens in the shallow cloned object that has a different reference (or memory address), and not the state itself.</li>\n</ol>\n<p>Thus, this is in compliant with React’s principle of not mutating state directly. After that, all you need to do is trigger a re-rendering with <code class=\"language-text\">this.setState({ items: ...this.state.items })</code>.</p>\n<ol start=\"2\">\n<li>\n<p>Jesstern’s feedback - “What if you move the cross from the component ToDoItemRight to ToDoItemLeft then would it still be called ToDoItemRight?” In short, I should name my component based on what it does rather than its positioning…</p>\n</li>\n<li>\n<p>Function cannot be spreaded, only objects and arrays can be spreaded.</p>\n</li>\n</ol>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax\">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax</a></p>","frontmatter":{"title":"JumpStart Frontend Project","date":"17 June 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/jumpstart-frontend-project/"}}