{"data":{"site":{"siteMetadata":{"title":"Jenssen Lee","author":"Jenssen Lee"}},"markdownRemark":{"id":"1b3ecc65-260a-555b-afae-4fc28dd39767","excerpt":"For those Redmi smartphone users, you might have searched queries like “Redmi Note 5 how to root with anti rollback check” before. Look no further, here’s a…","html":"<p>For those Redmi smartphone users, you might have searched queries like “Redmi Note 5 how to root with anti rollback check” before. Look no further, here’s a simplified tutorial of it. </p>\n<p>Or proceed <a href=\"https://miui.blog/redmi-note-5/root-bypass-arb/\">here</a>, if you prefer a longer and more detailed tutorial. </p>\n<p><strong>Use Case: I dropped and cracked my Redmi Note 5 screen and bought Redmi Note 7 Pro to replace it.</strong>   </p>\n<p>Therefore I wanted to use Titanium to back up and restore my files because it was the most comprehensive (or exhaustive?) backup app ever.\nHowever, it requires a rooted device - I proceed to root and back up all the desired files, contacts, messages etc. </p>\n<p>When I tried to root Redmi Note 7 Pro, it told me to wait for 360 hours (or 15 days) before Xiaomi allows me to unlock bootloader. I’ve read that the waiting time varies from 72 hours to 720 hours. What <a href=\"https://www.reddit.com/r/Xiaomi\">/r/Xiaomi</a> said: </p>\n<blockquote>\n<p>The waiting time on models manufactured before 2018 is 72 hours. On models manufactured in July 2018 or later, it is 720 hours. Currently there’s no known way to bypass the waiting time.</p>\n</blockquote>\n<p>Eventually I decided on using Mi Mover to transfer files over Wifi. Some apps weren’t transferred over, and the contacts and messages required multiple transfers… but it was quite reliable. </p>\n<h3>Prerequisites to unlock bootloader</h3>\n<ol>\n<li>\n<p><a href=\"http://en.miui.com/thread-237673-1-1.html\">Disable driver signature enforcement in Windows</a></p>\n</li>\n<li>\n<p><a href=\"https://forum.xda-developers.com/showthread.php?t=2588979\">Install ADB and Fastboot tools with drivers on Windows</a></p>\n</li>\n<li>\n<p>Enable OEM unlocking and USB debugging in your device</p>\n</li>\n</ol>\n<p>  a) Enable Developer Options in: <em>Settings/About Phone/MIUI version</em>. Click on it seven times.</p>\n<p>  b) Now go to: <em>Settings/Additional settings/Developer Options</em> and check <em>OEM unlocking</em> and <em>USB debugging</em>.</p>\n<ol start=\"4\">\n<li>Check if the bootloader is locked at <em>Settings/Additional settings/Developer Options/Mi Unlock status</em>.</li>\n</ol>\n<h3>Requisites</h3>\n<ol>\n<li>\n<p>Unlock bootloader</p>\n</li>\n<li>\n<p>Ensure the recovery ROM is in the same folder as Adb folder. shift + rightclick open command window here. Enter the following:</p>\n<ul>\n<li><code class=\"language-text\">fastboot getvar anti</code> </li>\n</ul>\n<p>If your ARB index is 4 or greater, enter <code class=\"language-text\">fastboot flash antirbpass dummy.img</code>. </p>\n<p>The command order your computer to flash dummy.img file to your device through the Fastboot interface. </p>\n<p>If your ARB index is 3, skip this step and to jump to the last bullet point.</p>\n<ul>\n<li>\n<p><code class=\"language-text\">fastboot flash recovery twrp-3.2.3-2-whyred.img</code></p>\n</li>\n<li>\n<p><code class=\"language-text\">fastboot boot twrp-3.2.3-2-whyred.img</code> to boot into TWRP Recovery, if not you will boot into Redmi Note 5 custom recovery</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Flash Magisk.zip</p>\n</li>\n<li>\n<p>Reboot to system</p>\n</li>\n</ol>","frontmatter":{"title":"Rooting Redmi Note 5 and Note 7 Pro","date":"11 April 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/rooting-redmi-note-5-and-note-7-pro/"}}