{"data":{"site":{"siteMetadata":{"title":"Jenssen Lee","author":"Jenssen Lee"}},"markdownRemark":{"id":"c118131a-0353-5647-9501-9a1eb073e677","excerpt":"ShopLah was created because I wanted to build a simple ecommerce website and familiarise myself more with authentication process and full-stack app flow.  It…","html":"<p>ShopLah was created because I wanted to build a simple ecommerce website and familiarise myself more with authentication process and full-stack app flow. </p>\n<p>It was created with the following libraries:</p>\n<blockquote>\n<p><strong>Client:</strong> React, React Router, Redux (redux-thunk, redux-logger, redux-persist), Material-UI</p>\n<p><strong>Server:</strong> Node.js, Express, ejs, Mongoose, dotenv, CORS</p>\n<p><strong>Authentication:</strong> Passport.js, passport-auth0 and express-session</p>\n<p><strong>Testing:</strong> Mocha and Chai</p>\n</blockquote>\n<h3>React Router</h3>\n<p>I used react-router because for <code class=\"language-text\">ReactDOM.render(&lt;App /&gt;)</code>, class component App needed a way to render between a bunch of routes such as ’/’, ‘/cart’, ‘/user/profile’. I didn’t know how to use server-side rendering for React.</p>\n<p>React-router could provide that out of the box. Whereas link or anchor tag doesn’t work because I’m choosing to render a specific component/container if the route tallies. </p>\n<p>Further explanation: <a href=\"https://stackoverflow.com/questions/27928372/react-router-urls-dont-work-when-refreshing-or-writing-manually\">Server-side vs Client-side</a></p>\n<h3>Redux</h3>\n<p>I chose Redux because I have never used it before and I wanted to play around with it. I like the idea of getting back the same output for the same input very much - it’s like Mathematics. </p>\n<p>However, the setup is a little verbose since you have to change/write code in a few places to make changes (like creating containers to mapStateToProps and mapDispatchToProps as compared to in React). The upside is whenever there’s a bug, it’s a lot easier to track it down. </p>\n<h4>Redux Thunk</h4>\n<p>In Redux, reducer must be pure - it can’t have any side effects - and action can only be an object. However, redux-thunk allows user to dispatch an action creator that returns a function instead of an action object. This function doesn’t need to be pure; it is allowed to have side effects, including executing asynchronous API calls. </p>\n<h4>Redux Persist</h4>\n<p>Redux-persist was used to persist data upon refresh. For example, the user is logged in and adds products to cart. The products should remain in Redux store when the user refreshes.</p>\n<h3>dotenv</h3>\n<blockquote>\n<p>Dotenv is a zero-dependency module that loads environment variables from a .env file into process.env.</p>\n</blockquote>\n<p>It allows user to store passwords, API keys and sensitive information in a file called <code class=\"language-text\">.env</code>. The file is usually added to <code class=\"language-text\">.gitignore</code> along with <code class=\"language-text\">node_modules</code> to prevent it from being added to git.</p>\n<h3>CORS</h3>\n<blockquote>\n<p>CORS is a node.js package for providing a Connect/Express middleware that can be used to enable CORS with various options.</p>\n</blockquote>\n<p><a href=\"https://www.html5rocks.com/en/tutorials/cors/\">Introduction</a></p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS\">CORS</a></p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy\">Same-origin policy</a></p>\n<p><strong>What is CORS?</strong></p>\n<p>CORS stands for Cross-Origin Resource Sharing. It is a mechanism that uses additional HTTP headers to tell a browser to let a web application running at one origin (domain) have permission to access selected resources from a server at different origin.</p>\n<p><strong>Why is it needed?</strong></p>\n<p>For security reasons, browsers restrict cross-origin HTTP requests initiated from within scripts. For example, XMLHttpRequest and the Fetch API follow the same-origin policy. This means that a web application using those APIs can only request HTTP resources from the same origin the application was loaded from, unless the response from the other origin includes the right CORS headers.</p>\n<p>The use-case for CORS is simple. Imagine the site alice.com has some data that the site bob.com wants to access. This type of request traditionally wouldn’t be allowed under the browser’s same origin policy. However, by supporting CORS requests, alice.com can add a few special response headers that allows bob.com to access the data.</p>\n<!--\n**Why did I have to use it for my webapp?**\n-->\n<h3>Passport</h3>\n<h4>passport-auth0</h4>\n<p>I chose passport-auth0 strategy because I was learning about authentication and Mongoose and was looking for a no-frills authentication method. Therefore, I chose a third-party authentication provider like Auth0. </p>\n<h4>express-session</h4>\n<blockquote>\n<p>The Auth0 Passport strategy enforces use of state parameter in OAuth 2.0 authorization requests and requires session support in Express to be enabled.</p>\n</blockquote>\n<p>Session data is not saved in the cookie itself, just the session ID. Session data is stored server-side.</p>\n<p>I needed express-session to store session ID, so that cookie session ID can be compared with server session ID. If it tallies, the user will be given access to that particular account.</p>","frontmatter":{"title":"Reasons for choosing ShopLah libraries","date":"3 April 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/reasons-for-choosing-shoplah-libraries/"}}