{"data":{"site":{"siteMetadata":{"title":"Jenssen Lee","author":"Jenssen Lee"}},"markdownRemark":{"id":"2524c923-eded-5d03-8e96-739a8a273e3a","excerpt":"Arms is the frontend, while Legs is the backend and the server. ARMS LEGS Arms github Legs github Problem ARMS help ThoughtWorks Singapore manage housing leases…","html":"<!-- ![ShopLah front page](../assets/shoplah.webp \"ShopLah front page\") -->\n<p>Arms is the frontend, while Legs is the backend and the server.</p>\n<p><a href=\"https://demo-armadillo-arms.herokuapp.com/\">ARMS</a></p>\n<p><a href=\"https://demo-armadillo-legs.herokuapp.com/\">LEGS</a></p>\n<p><a href=\"https://github.com/armadillo-apps/arms2\">Arms github</a></p>\n<p><a href=\"https://github.com/armadillo-apps/legs\">Legs github</a></p>\n<h3>Problem</h3>\n<p>ARMS help ThoughtWorks Singapore manage housing leases to foreign employees who travel to Singapore for projects.</p>\n<p>Client was using spreadsheet until we built a centralised system to allocate occupants to apartments and vice versa. Client can now easily generate reports and track expenses.</p>\n<h3>Solution</h3>\n<p>Our group project was for 3 weeks. Since we had limited time, we had to ascertain the necessary features our Minimum Viable Product (MVP) should deliver to provide maximum utility to the user. Afterwards, we slotted them into each sprint based on our velocity.</p>\n<p>Our MVP is a centralised system which allows the user to create apartments and occupants, and allocate occupants to apartments and vice versa.</p>\n<h4>Stack</h4>\n<ul>\n<li><em>Frontend:</em> React, Proptypes</li>\n<li><em>Backend:</em> Express, Mongoose</li>\n<li><em>Testing:</em> Jest, Jest-MongoDB, React Testing Library, Cypress for automated end-to-end testing</li>\n<li><em>DevOps:</em> CircleCi, Heroku, Netlify</li>\n<li><em>Misc:</em> Axios, CORS, Moment, Faker for faking test data</li>\n</ul>\n<h4>Accomplishments</h4>\n<ul>\n<li>Practised Test Driven Development (TDD) and followed Agile practices</li>\n<li>Brainstormed user stories, decided on MVP, estimated complexity of each card and our velocity, slotted the user stories into our sprints</li>\n<li>Pair programmed every day and swapped pairs frequently; rotated and took turns to be BA/QA</li>\n<li>Trunk based development: everyone worked on master branch instead of creating new feature branches</li>\n<li>Both frontend and backend deployed to Heroku</li>\n</ul>","frontmatter":{"title":"Apartments Residential Management System (ARMS)"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/projects/arms/"}}