{"data":{"site":{"siteMetadata":{"title":"Jenssen Lee","author":"Jenssen Lee"}},"markdownRemark":{"id":"187ca151-3038-5492-984a-1e25f74e5641","excerpt":"Yes, I know with the rise of IT in Singapore many coding bootcamps are popping up. This is a long overdued post but I hope it adds to the conversation. I would…","html":"<!-- 21 May - 8 August 2019 -->\n<p>Yes, I know with the rise of IT in Singapore many coding bootcamps are popping up. This is a long overdued post but I hope it adds to the conversation.</p>\n<p>I would recommend programs by <a href=\"https://www.imda.gov.sg/imtalent/programmes/tipp#EligiblePartnersandCourses\">Tech Immersion and Placement Programme</a> (TIPP) partners solely because it’s subsidied for Singaporeans.</p>\n<p>You might be wondering out of all the coding bootcamps like General Assembly and Trent College - why <a href=\"https://www.thoughtworks.com/jumpstart\">JumpStart</a>? Well, for Singaporeans it’s the cheapest at only 1k for three months compared to GA’s 5-6k! For Permanent Residents (PR), I vaguely recall a bootcamp mate mentioned that he paid 6-7k. Not sure.</p>\n<p>The instructors at JumpStart tend to have more experience too. I was from batch 5 and my instructors had a few years of working experience. That’s not taking into account of their well-known rigorous interview questions. GA, on the other hand, has a practice of recruiting their own graduates to come work as Teaching Assistants (TA). It’s doubtful how experienced the TAs are and how much assistance they can offer.</p>\n<p>If you need any other reasons, it’s because they teach Software Engineering best practices like Test Driven Development (TDD), pair programming, Agile methodology and trunk-based development. Moreover, they explained what mocking is, how to do it and you get to practise it during projects. As far as I know, GA doesn’t teach that.</p>\n<p>TDD means writing the test before the code. ThoughtWorks teaches that and front end testing too. Rarely do companies practise testing which means knowing how to write tests is a valuable skill that employers will look at. That alone sets JumpStart apart from other bootcamps in my opinion.</p>\n<p>ThoughtWorks is also a huge believer in pair programming. Imagine how stressful it is to have a real-life compiler beside you to scrutinise your code. You can’t get that sort of accountability by coding alone. Pairing forces you to explain your streams of consciousness and tests your understanding because first you have to know before you can teach. IMO this is the fastest way for a Junior engineer to level up by gaining access to a senior’s treasure trove of experience. You learn about the different problem solving approaches, the tradeoffs, library and language syntax, keyboard shortcuts. The senior gets to consolidate his/her knowledge and perhaps write a book…</p>\n<p>We practised Agile methodology whereby we spoke with the client and noted their feature requests. We translated them to user stories and wrote it down on index cards. As a team, we estimated the story points and our velocity (how many points we can finish in a week). We prioritised the features based on logical workflow and based on which features will deliver maximum value to the client.</p>\n<p>In conclusion, both ThoughtWorks and GA attract different kinds of people. Despite what I said, JumpStart has some prerequisites: applicants are required to do 5-6 Data Structure and Algorithm questions and are assessed on it before they are accepted. GA does not have similar requirements as far as I know. You can think of it like GA takes you from 0% - 60%, while JumpStart takes you from 20% - 80%.</p>\n<!-- what is trunk-based development? everything on master branch something something -->","frontmatter":{"title":"JumpStart by ThoughtWorks review","date":"19 January 2020"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/migrating-blog-from-netlify-to-github-pages/"}}